# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.

import random

x = int(random.randint(1, 1000))
y = int(random.randint(1, 1000))

s = x + y
p = x * y

print('Подсказка Пети:')
print('сумма загаданных чисел -', s)
print('произведение загаданных чисел -', p)

for x in range(1, 1001):
    for y in range(1, 1001):
        s_2 = x + y
        p_2 = x * y
        if s == s_2 and p == p_2:
            print(f'Задуманные числа: {x} и {y}')
            exit()